updated archi diagram
